<a href="https://colab.research.google.com/github/seansothey/NoSQL-BigData/blob/master/Problem2.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

##Generate a new table that displays the name of the student, their average grade, and the number of grades they had in their record.

##Given Code

In [9]:
import numpy as np
import pandas as pd

np.random.seed(seed=0)

Students = ['Samir', 'Mark', 'Zoe', 'Andrew', 'Rupert']
Grades_Data = []
for i in range(100):
    Student_Index = np.random.randint(0, len(Students))
    Student = Students[Student_Index]
    Grade = round(np.random.normal(loc=75, scale=15), 1)
    Grades_Data.append([Student, Grade])

Grades_df = pd.DataFrame(data=Grades_Data, columns=['Student', 'Grade'])
Grades_df.iloc[0:10]

  Student  Grade
0  Rupert   91.8
1  Andrew   79.5
2  Andrew   80.6
3     Zoe   90.6
4  Rupert   70.6
5  Rupert   73.0
6     Zoe   95.5
7   Samir   73.5
8    Mark   82.3
9   Samir   83.7

## Quick Solution

In [10]:
result = Grades_df[['Student', 'Grade']].groupby('Student').agg(['count', 'mean'])
result

        Grade
        count       mean
Student
Andrew     22  80.904545
Mark       18  81.333333
Rupert     18  74.900000
Samir      24  73.191667
Zoe        18  80.622222

##Alternative Solution

In [11]:
result = Grades_df.groupby('Student').agg(["mean","count"]).reset_index()
result.columns = result.columns.droplevel(0)
result.columns = ['Student Name', 'Average Grade','Number of Grade']
result

  Student Name  Average Grade  Number of Grade
0       Andrew      80.904545               22
1         Mark      81.333333               18
2       Rupert      74.900000               18
3        Samir      73.191667               24
4          Zoe      80.622222               18